{"config": [{"config": {"input_dtype": "float32", "trainable": true, "padding": [1, 1], "name": "zeropadding2d_1", "batch_input_shape": [null, 160, 320, 3]}, "class_name": "ZeroPadding2D"}, {"config": {"trainable": true, "cropping": [[60, 20], [0, 0]], "name": "cropping2d_1"}, "class_name": "Cropping2D"}, {"config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0004\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000sC\u0000\u0000\u0000d\u0001\u0000d\u0000\u0000l\u0000\u0000}\u0001\u0000d\u0001\u0000d\u0002\u0000l\u0001\u0000m\u0002\u0000}\u0002\u0000\u0001|\u0002\u0000j\u0003\u0000j\u0004\u0000|\u0000\u0000d\u0006\u0000\u0083\u0002\u0000}\u0003\u0000|\u0003\u0000d\u0004\u0000\u001bd\u0005\u0000\u0018}\u0003\u0000|\u0003\u0000S)\u0007N\u00e9\u0000\u0000\u0000\u0000)\u0001\u00da\u0002tf\u00e9@\u0000\u0000\u0000g\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?)\u0002r\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000)\u0005\u00da\u0003cv2\u00da\rkeras.backendr\u0002\u0000\u0000\u0000\u00da\u0005image\u00da\rresize_images)\u0004r\u0006\u0000\u0000\u0000r\u0004\u0000\u0000\u0000\u00da\u0003ktf\u00da\u0007resized\u00a9\u0000r\n\u0000\u0000\u0000\u00fa\u001f<ipython-input-13-5011d7e19d5c>\u00da\u0010resize_normalize\u0001\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0001\f\u0001\u0010\u0005\u0015\u0002\u000e\u0002", null, null], "output_shape": null, "name": "lambda_2", "output_shape_type": "raw", "trainable": true, "function_type": "lambda", "arguments": {}}, "class_name": "Lambda"}, {"config": {"b_constraint": null, "bias": true, "nb_filter": 24, "nb_row": 5, "trainable": true, "nb_col": 5, "b_regularizer": null, "activation": "linear", "W_constraint": null, "dim_ordering": "tf", "subsample": [2, 2], "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "name": "convolution2d_6", "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "relu1"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "trainable": true, "strides": [1, 1], "border_mode": "valid", "name": "maxpooling2d_6", "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"b_constraint": null, "bias": true, "nb_filter": 36, "nb_row": 5, "trainable": true, "nb_col": 5, "b_regularizer": null, "activation": "linear", "W_constraint": null, "dim_ordering": "tf", "subsample": [2, 2], "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "name": "convolution2d_7", "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "relu2"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "trainable": true, "strides": [1, 1], "border_mode": "valid", "name": "maxpooling2d_7", "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"b_constraint": null, "bias": true, "nb_filter": 48, "nb_row": 5, "trainable": true, "nb_col": 5, "b_regularizer": null, "activation": "linear", "W_constraint": null, "dim_ordering": "tf", "subsample": [2, 2], "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "name": "convolution2d_8", "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "relu3"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "trainable": true, "strides": [1, 1], "border_mode": "valid", "name": "maxpooling2d_8", "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"b_constraint": null, "bias": true, "nb_filter": 64, "nb_row": 3, "trainable": true, "nb_col": 3, "b_regularizer": null, "activation": "linear", "W_constraint": null, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "name": "convolution2d_9", "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "relu4"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "trainable": true, "strides": [1, 1], "border_mode": "valid", "name": "maxpooling2d_9", "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"b_constraint": null, "bias": true, "nb_filter": 64, "nb_row": 3, "trainable": true, "nb_col": 3, "b_regularizer": null, "activation": "linear", "W_constraint": null, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "name": "convolution2d_10", "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "relu5"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "trainable": true, "strides": [1, 1], "border_mode": "valid", "name": "maxpooling2d_10", "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_2"}, "class_name": "Flatten"}, {"config": {"input_dtype": "float32", "bias": true, "activity_regularizer": null, "output_dim": 1164, "trainable": true, "b_constraint": null, "activation": "linear", "W_constraint": null, "W_regularizer": null, "batch_input_shape": [null, 1600], "init": "glorot_uniform", "input_dim": 1600, "b_regularizer": null, "name": "dense_6"}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "relu6"}, "class_name": "Activation"}, {"config": {"input_dtype": "float32", "bias": true, "activity_regularizer": null, "output_dim": 100, "trainable": true, "b_constraint": null, "activation": "linear", "W_constraint": null, "W_regularizer": null, "batch_input_shape": [null, 1164], "init": "glorot_uniform", "input_dim": 1164, "b_regularizer": null, "name": "dense_7"}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "relu7"}, "class_name": "Activation"}, {"config": {"input_dtype": "float32", "bias": true, "activity_regularizer": null, "output_dim": 50, "trainable": true, "b_constraint": null, "activation": "linear", "W_constraint": null, "W_regularizer": null, "batch_input_shape": [null, 100], "init": "glorot_uniform", "input_dim": 100, "b_regularizer": null, "name": "dense_8"}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "relu8"}, "class_name": "Activation"}, {"config": {"input_dtype": "float32", "bias": true, "activity_regularizer": null, "output_dim": 10, "trainable": true, "b_constraint": null, "activation": "linear", "W_constraint": null, "W_regularizer": null, "batch_input_shape": [null, 50], "init": "glorot_uniform", "input_dim": 50, "b_regularizer": null, "name": "dense_9"}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "relu9"}, "class_name": "Activation"}, {"config": {"input_dtype": "float32", "bias": true, "activity_regularizer": null, "output_dim": 1, "trainable": true, "b_constraint": null, "activation": "linear", "W_constraint": null, "W_regularizer": null, "batch_input_shape": [null, 10], "init": "glorot_uniform", "input_dim": 10, "b_regularizer": null, "name": "dense_10"}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}